gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
    // Set flag 'system initialising' flag. In main loop where stm32 waits for
    // responses back from the ESP, if it gets a response saying a photo was taken
    // and the system init flag has been set then it knows that the photo was a test
    // photo as this flag is only set once on startup. The STM32 can then blink an
    // led to let the user know that the system has been initialised

    /****** START CODE BLOCK ******/
    // Description: This will need to be recommented back in but just checking if this is what is causing the bug
    // event_group_set_bit(&gbl_EventsStm, EVENT_STM_SYSTEM_INITIALISING, EGT_ACTIVE);
    /****** END CODE BLOCK ******/

    // Enter main loop
    bpk_t BpkEspResponse, MapleBpacket;
    uint8_t lastRTCSecond = 0;

    while (1) {

        /* Turn the ESP on or off depending on if there are esp tasks that need to occur */

        // The conditions the ESP should turn on are
        uint8_t espTurnOn = FALSE;
        if ((event_group_get_bits(&gbl_EventsEsp, EGT_ACTIVE) &
             ~((0x01 << EVENT_ESP_ON) | (0x01 << EVENT_ESP_READY))) != 0) {
            espTurnOn = TRUE;
        }

        /* Have commented this out for testing. Comment it back in when done testing */
        // if (GPIO_PIN_IS_HIGH(USBC_CONN_PORT, USBC_CONN_PIN)) {
        //     espTurnOn = TRUE;
        // }

        // Check if there are any esp flags that are set that are not ESP_ON or ESP_READY
        if (espTurnOn) {

            // There is an esp event that needs to occur. Ensure the ESP has been turned on
            if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE) != TRUE) {
                wd_esp_turn_on();

                /****** START CODE BLOCK ******/
                // Description: Debugging. Remove when done. ESP is currently turned off so to simulate, pretend I
                // got a ping back
                event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_READY, EGT_ACTIVE);
                log_usb_message("ESP Ready\r\n");
                /****** END CODE BLOCK ******/
            }
        } else {

            // For testing purposes I have removed the condition that the ESP will always be on when
            // USB C is connected
            // // There are no pending esp events. Turn the ESP off if it is not already off
            if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE) == TRUE) {
                wd_esp_turn_off();
            }

            // Only turn the ESP off is the USB is not connected
            // if (GPIO_PIN_IS_HIGH(USBC_CONN_PORT, USBC_CONN_PIN) == FALSE) {
            //     // There are no pending esp events. Turn the ESP off if it is not already off
            //     if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE) == TRUE) {
            //         wd_esp_turn_off();
            //     }
            // }
        }

        /* Put the STM32 to sleep if required */
        if (event_group_poll_bit(&gbl_EventsStm, EVENT_STM_SLEEP, EGT_ACTIVE) == TRUE) {
            event_group_clear_bit(&gbl_EventsStm, EVENT_STM_SLEEP, EGT_ACTIVE);

            /****** START CODE BLOCK ******/
            // Description: Debugging
            log_usb_message("Putting STM32 to sleep\r\n");

            // This won't be needed here for the full thing and is just here for testing
            // usb_denit();
            /****** END CODE BLOCK ******/

            /****** START CODE BLOCK ******/
            // Description: Test code

            // Disable HAL tick
            HAL_SuspendTick();
            HAL_PWR_EnterSTOPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI);

            // Device now in sleep mode. Wakes up by interrupt from RTC
            HAL_Init();
            hardware_clock_config();
            hardware_config_init();

            /****** START CODE BLOCK ******/
            // Description: Just for debugging. Can remove when not required
            // Delay for a bit to give time to plug USBC back in to see the message
            uint8_t i = 0;
            while (i < 30) {
                GPIO_TOGGLE(LED_GREEN_PORT, LED_GREEN_PIN);
                HAL_Delay(1000);
                i++;
            }
            log_usb_message("STM woken back up\r\n");

            /****** END CODE BLOCK ******/
        }

        /* Request ESP32 to take a photo if the 'take photo' flag has been set */
        if ((event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE) == TRUE) &&
            (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING) == FALSE)) {

            // Don't request a photo until the ESP is in the ready state. The ESP takes
            // a second or two to startup after it has been turned on. The ESP_READY flag
            // will be set automatically by the STM when the ESP is ready to receive commands
            if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_READY, EGT_ACTIVE) == TRUE) {
                event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE);

                dt_datetime_t Rtc1;
                if (rtc_read_datetime(&Rtc1) != TRUE) {
                    wd_error_handler(__FILE__, __LINE__);
                }

                log_usb_message("Taking a photo at %i:%i:%i %i/%i/%i\r\n", Rtc1.Time.second, Rtc1.Time.minute,
                                Rtc1.Time.hour, Rtc1.Date.day, Rtc1.Date.month, Rtc1.Date.year);

                /****** START CODE BLOCK ******/
                // Description: Simulating the ESP turning on and taking a photo. When you turn the ESP on for real you
                // can delete this code
                event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING);
                /****** END CODE BLOCK ******/

                // log_usb_message("Taking a photo!\r\n");
                // Commenting out the actual photo request but comment it back in when you want to take photos
                // uint8_t errorCode[1];
                // if (wd_request_photo_capture(errorCode) != TRUE) {
                //     wd_error_handler_2("Error %s on line %i. Code %i\r\n", __FILE__, __LINE__, errorCode[0]);
                // }
            }
        }

