gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
            /****** START CODE BLOCK ******/
            // Description: Debugging. Can delete whenever
            bpk_t DebugMessage;
            bpk_create_sp(&DebugMessage, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message,
                          BPK_Code_Success, "STM ack Maple req list dir");
            wd_write_bpacket_maple(&DebugMessage);
            /****** END CODE BLOCK ******/

            bpk_create(&BpkStmResponse, BPK_Addr_Receive_Esp32, BPK_Addr_Send_Stm32, BPK_Req_List_Dir, BPK_Code_Execute,
                       0, NULL);
            wd_write_bpacket_esp(&BpkStmResponse);
            break;

        case BPK_REQ_TAKE_PHOTO:;

            /****** START CODE BLOCK ******/
            // Description: Testing this bit of code. Can delete if necessary
            uint8_t occured = FALSE;
            bpk_t debugMessage;
            if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE) == FALSE) {
                bpk_create_sp(&debugMessage, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message,
                              BPK_Code_Success, "Maple request but ESP is not on");
                wd_write_bpacket_maple(&debugMessage);
                occured = TRUE;
            }
            if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_READY, EGT_ACTIVE) == FALSE) {
                bpk_create_sp(&debugMessage, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Message,
                              BPK_Code_Success, "Maple request but ESP is not ready");
                wd_write_bpacket_maple(&debugMessage);
                occured = TRUE;
            }

            if (occured == TRUE) {
                return;
            }
            /****** END CODE BLOCK ******/

            /* Set the required event group bits */
            event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE);
            event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_STM_REQUEST);
            event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING);

            break;

        case BPK_REQ_SET_DATETIME:;

            // Extract the datetime
            dt_datetime_t Datetime;
            if (dt_datetime_init(&Datetime, Bpacket->Data.bytes[0], Bpacket->Data.bytes[1], Bpacket->Data.bytes[2],
                                 Bpacket->Data.bytes[3], Bpacket->Data.bytes[4],
                                 (((uint16_t)Bpacket->Data.bytes[5]) << 8) | Bpacket->Data.bytes[6]) != TRUE) {
                // TODO: Handle error
                break;
            }

            /* Update the RTC with the new datetime */
            if (rtc_write_datetime(&Datetime) != TRUE) {
                // TODO: Handle the error

                break;
            }

            bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Set_Datetime,
                       BPK_Code_Success, 0, NULL);
            wd_write_bpacket_maple(&BpkStmResponse);
            break;

        case BPK_REQ_SET_WATCHDOG_SETTINGS:;

            /* Extract the settings from the bpacket and convert them to structs */
            capture_time_t NewCaptureTimeSettings;
            camera_settings_t NewCamSettings;
            wd_utils_bpk_to_settings(Bpacket, &NewCaptureTimeSettings, &NewCamSettings);

            /* Write new settings to flash */
            if (wd_write_settings(&NewCaptureTimeSettings, &NewCamSettings) != TRUE) {
                wd_error_handler(__FILE__, __LINE__);
            }

            // Update the camera settings structs by reading the flash
            wd_read_settings(&gbl_CaptureTime, &lg_CameraSettings);

            /* Send success response */
            bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Set_Watchdog_Settings,
                       BPK_Code_Success, 0, NULL);
            wd_write_bpacket_maple(&BpkStmResponse);

            break;

        case BPK_REQ_GET_WATCHDOG_SETTINGS:;

            /* Store current watchdog settings into bpacket and send to computer */
            uint8_t settingsData[20];
            wd_utils_settings_to_array(settingsData, &gbl_CaptureTime, &lg_CameraSettings);

            /* Create bpacket and send to computer */
            bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Get_Watchdog_Settings,
                       BPK_Code_Success, 20, settingsData);
            wd_write_bpacket_maple(&BpkStmResponse);

            break;

        case BPK_REQ_GET_TEMPERATURE:;

            if (ds18b20_read_temperature(&Ds18b20) != TRUE) {
                wd_error_handler(__FILE__, __LINE__);
            }

            uint8_t tempData[sizeof(float)];
            float_to_u8(tempData, Ds18b20.temp);
            bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Get_Temperature,
                       BPK_Code_Success, sizeof(float), tempData);
            wd_write_bpacket_maple(&BpkStmResponse);

            break;

        default:
            wd_error_handler_2("Error %s on line %i. Unexpected request %i\r\n", __FILE__, __LINE__,
                               Bpacket->Request.val);
    }

    // TODO: implement
}

void wd_write_bpacket_maple(bpk_t* Bpacket) {
    static bpk_buffer_t Buffer;
    bpk_to_buffer(Bpacket, &Buffer);
    log_usb_bytes(Buffer.buffer, Buffer.numBytes);
}

void wd_write_bpacket_esp(bpk_t* Bpacket) {
    static bpk_buffer_t Buffer;
    bpk_to_buffer(Bpacket, &Buffer);
    uart_transmit_data(UART_ESP32, Buffer.buffer, Buffer.numBytes);
}

void wd_handle_esp_response(bpk_t* Bpacket) {

    bpk_t BpkStmResponse;

    if (Bpacket->Request.val == BPK_REQUEST_PING) {

        /* Clear timeout */

        // Ping from ESP received => ESP ready to take requests. Settings both event
        // bits just incase ESP_ON hasn't been set for some reason
        event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE);
        event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_READY, EGT_ACTIVE);

